src/performance/scenarios/location-api.yaml
config:
  target: https://api.qa.soum.sa/api-v2/rest/api/v1/product/?page%20number=5&size={{size}}
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - set:
              size: 1 # Initialize size
          - get:
              url: "/api-v2/rest/api/v1/product/?page%20number=5&size={{size}}"
              headers:
                Content-Type: application/json

        count: 100
  - flow:
      - set:
          size: "{{__iteration}}"